# -*- coding: utf-8 -*-
import pandas as pd
pd.options.display.max_rows = 60

path = '/Users/xuegeng/Downloads/373_373_2.xls'
df = pd.read_excel(path)

#original_col = df.columns
#sam_col = df.columns[6:]
#striped_col = map(lambda x:x.strip(u"、")[0],sam_col)
#striped_col = ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19_1']

df1 = df[df.ix[:,6]==1].copy()
df2 = df[df.ix[:,6]==2].copy()
df1_ques = [
       u'2、请问您对蚂蚁花呗的接受程度如何？（数字越大表示接受程度越高）', u'3、红包抵扣这种优惠方式对您的吸引力是？',
       u'4、今年双11用蚂蚁花呗完成第1亿笔付款的用户，2016全年的花呗账单全部免单，这对您的吸引力是？',
       u'5、蚂蚁花呗用户经常有专享的抽奖活动及各商家优惠券，例如一分钱看电影，这对您的吸引力是？',
       u'6、分期付款免息优惠活动对您的吸引力是？', u'7、双十一高峰时使用蚂蚁花呗一次支付成功率为99.99%，这对您的吸引力是？',
       u'8、双十一使用蚂蚁花呗支付速度最快，这对您的吸引力是？',
       u'9、蚂蚁花呗与实体商铺合作，可以先线下消费，后线上付款，这对您的吸引力是？',
       u'10、境外支持蚂蚁花呗的门店有8万家，分布20国，这对您的吸引力是？',
       u'11、阿里旅行（飞猪）中接入蚂蚁花呗，可以先旅游，后付款，这对您的吸引力是？',
       u'12、蚂蚁花呗和医院合作，可以先治病，后付款，这对您的吸引力是？', u'13、每月10号为蚂蚁花呗最晚还款日，这对您的吸引力是？',
       u'14、以上提到的关于蚂蚁花呗的这些方面：优惠活动（分期免息、红包折扣、抽奖）、支付性能、还款规则、多种使用场景，总体来说对您的吸引力是？',
       u'15、扫脸凭颜值领额度的提额活动对您的吸引力是？', u'16、“女王大人额度”活动（向男性好友索要额度）对您的吸引力是？',
       u'17、蚂蚁花呗在双十一当天提高额度，这对您的吸引力是？',
       u'18、信用情况好的花呗好友越多，越有可能提升花呗额度，这项规则对您的吸引力是？', u'20、您使用蚂蚁花呗时通常会采用以下哪种方式还款？',
       u'22、回答完所有问题后，您对蚂蚁花呗的接受程度如何？（数字越大表示接受程度越高）', u'23、我打算将来继续使用蚂蚁花呗。',
       u'24、我预计将来会继续频繁地使用蚂蚁花呗。', u'25、我会大力推荐其他人使用蚂蚁花呗。', u'29、您的年龄是？',
       u'30、您的性别是？', u'31、您的职业是？', u'32、您的月收入是？']
df1 = df1[df1_ques]
df1_quess = [u'2', u'3',u'4',u'5',u'6', u'7',u'8',u'9',u'10',u'11',u'12', u'13',
            u'14',u'15', u'16',u'17',u'18', u'20',u'22', u'23',u'24', u'25', u'29',
            u'30', u'31', u'32']
df1.columns = df1_quess
df1.index = pd.Index(range(df1.count()[0]))
df1['stu'] = df1['31'].apply(lambda x: 1 if x==1 else 0)
df1['clerk'] = df1['31'].apply(lambda x: 1 if x==2 else 0)
df1['gov'] = df1['31'].apply(lambda x: 1 if x==3 else 0)
df1['free'] = df1['31'].apply(lambda x: 1 if x==4 else 0)


df2_ques = [
       u'2、请问您对蚂蚁花呗的接受程度如何？（数字越大表示接受程度越高）', u'3、红包抵扣这种优惠方式对您的吸引力是？',
       u'4、今年双11用蚂蚁花呗完成第1亿笔付款的用户，2016全年的花呗账单全部免单，这对您的吸引力是？',
       u'5、蚂蚁花呗用户经常有专享的抽奖活动及各商家优惠券，例如一分钱看电影，这对您的吸引力是？',
       u'6、分期付款免息优惠活动对您的吸引力是？', u'7、双十一高峰时使用蚂蚁花呗一次支付成功率为99.99%，这对您的吸引力是？',
       u'8、双十一使用蚂蚁花呗支付速度最快，这对您的吸引力是？',
       u'9、蚂蚁花呗与实体商铺合作，可以先线下消费，后线上付款，这对您的吸引力是？',
       u'10、境外支持蚂蚁花呗的门店有8万家，分布20国，这对您的吸引力是？',
       u'11、阿里旅行（飞猪）中接入蚂蚁花呗，可以先旅游，后付款，这对您的吸引力是？',
       u'12、蚂蚁花呗和医院合作，可以先治病，后付款，这对您的吸引力是？', u'13、每月10号为蚂蚁花呗最晚还款日，这对您的吸引力是？',
       u'14、以上提到的关于蚂蚁花呗的这些方面：优惠活动（分期免息、红包折扣、抽奖）、支付性能、还款规则、多种使用场景，总体来说对您的吸引力是？',
       u'22、回答完所有问题后，您对蚂蚁花呗的接受程度如何？（数字越大表示接受程度越高）',  u'26、我将来打算使用蚂蚁花呗。',
       u'27、我预计将来会频繁地使用蚂蚁花呗。', u'28、我将来会大力推荐其他人使用蚂蚁花呗。', u'29、您的年龄是？',
       u'30、您的性别是？', u'31、您的职业是？', u'32、您的月收入是？']
df2 = df2[df2_ques]
df2_quess = [u'2', u'3',u'4',u'5',u'6', u'7',u'8',u'9',u'10',u'11',u'12', u'13',
            u'14',u'22',  u'26',u'27', u'28', u'29',u'30', u'31', u'32']
df2.columns = df2_quess
df2.index = pd.Index(range(df2.count()[0]))
df2['stu'] = df2['31'].apply(lambda x: 1 if x==1 else 0)
df2['clerk'] = df2['31'].apply(lambda x: 1 if x==2 else 0)
df2['gov'] = df2['31'].apply(lambda x: 1 if x==3 else 0)
df2['free'] = df2['31'].apply(lambda x: 1 if x==4 else 0)
#(df1[list(df.columns)]<0).any()
#df1.
df1.to_excel('/Users/xuegeng/Desktop/df1.xlsx')
df2.to_excel('/Users/xuegeng/Desktop/df2.xlsx')
